//BNKSTMT JOB (@TS3,FF12),'STMT X47636',MSGCLASS=Q,MSGLEVEL=(1,1),
//         NOTIFY=&SYSUID,CLASS=O,REGION=0M
//STEP1    EXEC PGM=IKJEFT01
//STEPLIB  DD DSN=SYS1.DSNDB2T.SDSNLOAD,DISP=SHR
//DATECARD DD *
202606
//SORTCODE DD *
123456
//SYSPRINT DD   SYSOUT=*
//SYSOUT   DD   SYSOUT=*
//SYSTSPRT DD   SYSOUT=*
//SYSTSIN  DD *
 DSN SYSTEM(DB2T)
 RUN  PROGRAM(BNKSTMT) PLAN(BNKSTMT) -
      LIB('P2DEV01.TEST.LINKLIB')
 END                                                                     
/*
