//*
//* Copyright IBM Corp. 2026
//*
//BNK3STMX JOB 'BATCH',NOTIFY=&SYSUID,CLASS=A,MSGCLASS=H,
//          MSGLEVEL=(1,1),REGION=0M
//*
//DELRPT   EXEC PGM=IEFBR14
//STMTRPT  DD  DISP=(MOD,DELETE,DELETE),
//             DSN=BANKZ.V0R1M0.BNK3STMT.REPORT,
//             UNIT=SYSALLDA,
//             SPACE=(TRK,0)
//*
//BNK3STMT EXEC PGM=IKJEFT01,DYNAMNBR=20
//STEPLIB  DD  DISP=SHR,DSN=BANKZ.V0R1M0.LOAD
//         DD  DISP=SHR,DSN=DB2V13.SDSNEXIT
//         DD  DISP=SHR,DSN=DB2V13.SDSNLOAD
//         DD  DISP=SHR,DSN=DBD1.RUNLIB.LOAD
//         DD  DISP=SHR,DSN=CEE.SCEERUN
//         DD  DISP=SHR,DSN=CEE.SCEERUN2
//*
//SORTCODE DD  *
987654
/*
//*
//DATECARD DD  *
202608
/*
//*
//*
//STMTRPT  DD  DISP=(MOD,CATLG,CATLG),
//             DSN=BANKZ.V0R1M0.BNK3STMT.REPORT,
//             UNIT=SYSALLDA,
//             SPACE=(CYL,(150,50),RLSE),
//             DCB=(RECFM=FB,LRECL=132,BLKSIZE=27984)
//SYSPRINT DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
//CEEDUMP  DD  SYSOUT=*
//SYSTSPRT DD  SYSOUT=*
//SYSTSIN  DD  *
 DSN SYSTEM(DBD1)
 RUN PROGRAM(BNK3STMT) -
 PLAN(BANKZPLN) -
 LIB('BANKZ.V0R1M0.LOAD')
 END
/*
